google-chrome
fish
neovim
iterm2
raycast
stats
iina
visual-studio-code
macs-fan-control
flipper
spotify
notion
charles
slack
intellij-idea
android-studio
android-platform-tools
scrcpy
yarn
openjdk
node
cocaopods

koekeishiya/formulae/yabai
koekeishiya/formulae/skhd

font-jetbrains-mono-nerd-font

starship
