# shell
fish

# browser
google-chrome

# terminal
iterm2

# dev tools
android-studio
visual-studio-code
intellij-idea

# dev env
openjdk@17
cocoapods
android-platform-tools
node@20
yarn

# utilities
stats
macs-fan-control
raycast
koekeishiya/formulae/yabai
koekeishiya/formulae/skhd
wget

# misc
slack
iina
rectangle
gh
font-jetbrains-mono-nerd-font
whatsapp
spotify
